content: fix up Operating Systems notes
